app/views/class_lists/index.html.erb

SELECT COUNT(*) FROM "class_statuses" WHERE "class_statuses"."class_list_id" = $1  [["class_list_id", 1]]
---
        <td><%= class_list.c_name %></td>
        <td><%= ClassStatus.where(class_list_id: class_list.id).size %></td>

SELECT  "class_lists".* FROM "class_lists" WHERE "class_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "class_statuses" WHERE "class_statuses"."class_list_id" = $1  [["class_list_id", 1]]
---
		<tr>
			<td><%= ClassList.find(class_list.class_list_id).c_name%></td>
			<td><%= ClassStatus.where(class_list_id: ClassList.find(class_list.class_list_id)).size%></td>