app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
SELECT "tests".* FROM "tests"
---
  def index
    @articles = Article.all
	@tests = Test.all

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 1]]
---
  def show
	  @comments = Comment.where(article_id: @article.id)

INSERT INTO "articles" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "봉사자모집"], ["content", "봉사자를 모집합니다!!\r\n"], ["created_at", "2022-10-12 06:04:40.461327"], ["updated_at", "2022-10-12 06:04:40.461327"]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "cotent" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["cotent", "asdasd"], ["updated_at", "2022-10-05 06:29:46.823095"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)