app/controllers/class_statuses_controller.rb

SELECT "class_statuses".* FROM "class_statuses"
---
  def index
    @class_statuses = ClassStatus.all

SELECT  "class_lists".* FROM "class_lists" WHERE "class_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show_users
	  @class_list = ClassList.find(params[:class_list_id])

INSERT INTO "class_statuses" ("user_id", "class_list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["class_list_id", 39], ["created_at", "2022-10-25 06:31:23.196067"], ["updated_at", "2022-10-25 06:31:23.196067"]]
---
  def create
    @class_status = ClassStatus.new(class_status_params)

    respond_to do |format|
      if @class_status.overlap?
        format.html { redirect_to root_path, notice: "중복신청은 되지 않습니다." }
	  elsif @class_status.full?
		format.html { redirect_to root_path, notice: "수강인원은 초과할 수 없습니다." }
	  elsif @class_status.overrange?
		  format.html { redirect_to root_path, notice: "수강 할 수있는 강좌 수 가 넘었습니다." }
	  else
	  	@class_status.save

DELETE FROM "class_statuses" WHERE "class_statuses"."id" = $1  [["id", 6]]
---
  def destroy
    @class_status.destroy

SELECT  "class_statuses".* FROM "class_statuses" WHERE "class_statuses"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_class_status
      @class_status = ClassStatus.find(params[:id])