app/controllers/class_lists_controller.rb

  def index
    @class_lists = ClassList.all
	@my_class_lists = ClassStatus.where(user_id: current_user.id)
---
SELECT "class_lists".* FROM "class_lists"
SELECT "class_statuses".* FROM "class_statuses" WHERE "class_statuses"."user_id" = $1  [["user_id", 3]]

  def create
    @class_list = ClassList.new(class_list_params)

    respond_to do |format|
      if @class_list.save
---
INSERT INTO "class_lists" ("c_name", "c_account", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["c_name", "오픈소스"], ["c_account", 10], ["created_at", "2022-10-25 05:37:22.179876"], ["updated_at", "2022-10-25 05:37:22.179876"]]

    def set_class_list
      @class_list = ClassList.find(params[:id])
---
SELECT  "class_lists".* FROM "class_lists" WHERE "class_lists"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]