app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

		respond_to do |format|
		  if @comment.save
---
INSERT INTO "comments" ("comment", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comment", "a"], ["article_id", 10], ["created_at", "2022-10-12 06:57:31.106749"], ["updated_at", "2022-10-12 06:57:31.106749"]]