app/controllers/tests_controller.rb

  def create
    @test = Test.new(test_params)

    respond_to do |format|
      if @test.save
---
INSERT INTO "tests" ("name", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "김희준"], ["age", 24], ["created_at", "2022-10-04 06:13:37.556923"], ["updated_at", "2022-10-04 06:13:37.556923"]]

  def update
    respond_to do |format|
      if @test.update(test_params)
---
UPDATE "tests" SET "age" = $1, "updated_at" = $2 WHERE "tests"."id" = $3  [["age", 29], ["updated_at", "2022-10-11 06:24:58.327881"], ["id", 4]]

  def destroy
    @test.destroy
---
DELETE FROM "tests" WHERE "tests"."id" = $1  [["id", 2]]