app/models/class_status.rb

	def overlap?
		ClassStatus.where(user_id: self.user_id, class_list_id: self.class_list_id).size > 0
---
SELECT COUNT(*) FROM "class_statuses" WHERE "class_statuses"."user_id" = $1 AND "class_statuses"."class_list_id" = $2  [["user_id", 2], ["class_list_id", 38]]

	def full?
		ClassStatus.where(class_list_id: self.class_list_id).size >= ClassList.find(self.class_list_id).c_account
---
SELECT COUNT(*) FROM "class_statuses" WHERE "class_statuses"."class_list_id" = $1  [["class_list_id", 38]]

	def overrange?
		ClassStatus.where(user_id: self.user_id).size >= 7
---
SELECT COUNT(*) FROM "class_statuses" WHERE "class_statuses"."user_id" = $1  [["user_id", 2]]